In [3]:
import pandas as pd

In [5]:
bank1 = pd.read_csv('bank1.csv')
bank2 = pd.read_csv('bank2.csv')
bank3 = pd.read_csv('bank3.csv')

In [12]:
bank1 = bank1.rename({'timestamp':'date', 'type':'transaction', 'amount':'amounts'}, axis=1)
bank1

         date transaction  amounts  from   to
0  Oct 1 2019      remove     99.2   198  182
1  Oct 2 2019         add   2000.1   188  198

In [14]:
bank2

         date transaction  amounts   to  from
0  03-10-2019      remove     99.4  182   198
1  04-10-2019         add   2123.5  198   188

In [17]:
bank3

0       5
1    1060
Name: euro, dtype: int64

         date transaction  amounts  from   to
0  Oct 1 2019      remove     99.2   198  182
1  Oct 2 2019         add   2000.1   188  198
0  03-10-2019      remove     99.4   198  182
1  04-10-2019         add   2123.5   188  198

In [20]:
bank3 = bank3.rename({'date_readable':'date', 'type':'transaction'}, axis=1)
bank3 = bank3.assign(amounts = bank3['euro'].astype(str) + '.' +bank3['cents'].astype(str))
bank3

         date transaction  euro  cents   to  from amounts
0  5 Oct 2019      remove     5      7  182   198     5.7
1  6 Oct 2019         add  1060      8  198   188  1060.8

In [23]:
df = pd.concat([bank1,bank2,bank3])
df

         date transaction amounts  from   to    euro  cents
0  Oct 1 2019      remove    99.2   198  182     NaN    NaN
1  Oct 2 2019         add  2000.1   188  198     NaN    NaN
0  03-10-2019      remove    99.4   198  182     NaN    NaN
1  04-10-2019         add  2123.5   188  198     NaN    NaN
0  5 Oct 2019      remove     5.7   198  182     5.0    7.0
1  6 Oct 2019         add  1060.8   188  198  1060.0    8.0

In [26]:
import datetime
# df['date'.astype(date)]
df['date'] = pd.to_datetime(df['date'])

In [31]:
df.dtypes

date           datetime64[ns]
transaction            object
amounts                object
from                    int64
to                      int64
euro                  float64
cents                 float64
dtype: object

In [29]:
import csv
with open('bank1.csv', newline='') as csvfile:
    reader = csv.DictReader(csvfile)
    for row in reader:
        print(row)

OrderedDict([('timestamp', 'Oct 1 2019'), ('type', 'remove'), ('amount', '99.20'), ('from', '198'), ('to', '182')])
OrderedDict([('timestamp', 'Oct 2 2019'), ('type', 'add'), ('amount', '2000.10'), ('from', '188'), ('to', '198')])